app/views/static_pages/root.html.erb


  var USERS = <%= User.all.to_json.html_safe %>
---
SELECT "users".* FROM "users"