app/controllers/api/photos_controller.rb

INSERT INTO "photos" ("created_at", "owner_id", "title", "updated_at", "url") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["created_at", Fri, 27 Sep 2013 16:17:08 UTC +00:00], ["owner_id", 1], ["title", "Photos"], ["updated_at", Fri, 27 Sep 2013 16:17:08 UTC +00:00], ["url", "www.photo"]]
---
  def create
    @photo = Photo.new(title: params[:title], url: params[:url])
    @photo.owner_id = current_user.id

    if @photo.save