app/controllers/api/photo_taggings_controller.rb

SELECT "photo_taggings".* FROM "photo_taggings" WHERE "photo_taggings"."photo_id" = 4
SELECT "photos".* FROM "photos" WHERE "photos"."id" = $1 LIMIT 1  [["id", "4"]]
---
  def index
    @photo_taggings = Photo.find(params[:photo_id]).photo_taggings

INSERT INTO "photo_taggings" ("created_at", "photo_id", "updated_at", "user_id", "x_pos", "y_pos") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["created_at", Mon, 30 Sep 2013 17:24:25 UTC +00:00], ["photo_id", 4], ["updated_at", Mon, 30 Sep 2013 17:24:25 UTC +00:00], ["user_id", 3], ["x_pos", 200], ["y_pos", 200]]
---
  def create

    @photo_tagging = PhotoTagging.new(
      user_id: params[:user_id],
      photo_id: params[:photo_id],
      x_pos: params[:x_pos],
      y_pos: params[:y_pos]
    )

    if @photo_tagging.save